import Mock from 'mockjs'

Mock.mock('api/getparentPost', {
    parentPost: {
        avatarUrl: 'http://avatar.doufan.tv/372861F9-C174-4830-AE64-ADC4E3CEE185_141532.jpg',
        nickName: '青秋',
        resourceUrl: 'http://static.doufan.tv/upload/post-resource/n2CoZoyUG5Umyhjy_1525918761490.mp3',
        title: '你变了，我们离婚吧',
        content: '总有人说，婚姻熬不过七年之痒。其实很多时候，我们不是不爱了，而是忘记了到底应该怎么爱。就像宋丹丹曾说的： 原本只想要一个拥抱，不小心多了一个吻，然后你发现需要一张床，一套房，一个证件=，离婚的时候才想起：你原本只想要一个拥抱。 这就是我们的爱情，也常常，是我们的人生。 很多时候，我们走着走着就散了，那张脸看着看着就倦了。你觉得是因为生活的平淡和琐碎耗尽了彼此的激情。 其实只是你忘记了当初那个执着说爱的自己，忘记了当初为什么要选择这个人走向明天，忘记了去实现每天拥抱亲吻说爱对方的诺言。 原来，我们不是不爱了，而是忘记了到底应该怎么爱。 生活像是一个绚烂的赌场，也是一个巨大的黑洞。而欲望，就像幕后玩家，默默操控着我们的人生，让你迷失在生活里。 所以我们可以为了名利出人头地，可以为了家庭舍生取义。但是，我们却忘记了，过程中最重要的东西。 于是，当婚姻有矛盾了，我们首先想到的是离婚，却想不起来，在婚礼上，看到TA迎面走来时，心里只有一句话「无论贫穷富贵，我们都要生死在一起」； 如果有一天，你因为现实的挫败和人趋利避害的本能，开始产生焦虑和逃避的念头，与其让自己迷茫地往前走，不如停下来看看。'
    },
}),
    Mock.mock('api/subPost', {
        subPost: {
            avatarUrl: 'http://avatar.doufan.tv/498E6256-33D4-468B-A386-A297C3DFAE78_141445.jpg',
            nickName: '喵小九',
            resourceUrl: 'http://static.doufan.tv/upload/post-resource/7XHDiY8ni7nwdf9l_1525798625858.mp3',
            title: '结婚后的女人，不能穷',
            content: '婚后的女人，一定不能在物质上当穷人。你一定要有自己赖以生存的工作和能维持温饱的积蓄。 也许你有了自食其力的能力，婚姻生活不一定幸福。但是没有独立的经济来源，你的日子，就注定充满了鸡零狗碎不如意。 在婚姻里，女人必须要学会懂得独处，懂得悦己，懂得丰富自己的精神生活，而不是围着男人团团转。 因为当你的精神一旦不独立，把所有希望，情绪，状态都寄托在他人身上， 如果你被抛弃，失去他，就如失去整个世界，到时候你不仅会痛不欲生，也会失去重新生活下去的勇气和信心。 其实在婚姻里，女人一定要懂得，为自己的生活留白。 你一定要在百忙之中抽出空，把自己从现实中暂时抽离出来。一个吝啬为自己花时间的人，是没办法真正地学会爱自己，也无法正确地爱其他人。 很多女人把婚姻当作自己的庇护所，于是她们放弃自我，放弃理想，放弃求生的本能。 殊不知，这个世界上，真正的安全感任何人都给不了你，唯有你自己才是自己的过来人。 人到中年，才知道，孩子不需要一个保姆型妈妈，丈夫也不需要一个钟点式的妻子。但是你却需要一个具有独立人格的自己。 所以说，婚后的女人，切忌不能“穷”。'
        }
    })